/*************************************************************************
    > File Name: test1.cpp
    > Author: 潘梦园
    > brief:  
    > Created Time: 2018年12月01日 星期六 20时16分41秒
 ************************************************************************/

#include <iostream>

class A {
private:
    int n1;
    int n2;
public:
    A() : n2(0), n1(n2 + 2) {

    }
    void print() {
        std::cout<< "n1: " << n1 << "\nn2: " << n2 << std::endl;
    }
};

int main() {
    A a;
    a.print();

    return 0;
}
/*
 在 C++中，成员变量的初始化顺序与变量在类型中的申明顺序相同
 而与它们在构造函数的初始化列表中的顺序无关,所以n1为一个随机数，n2为0。
 */
